# Pandas

In [1]:
import pandas as pd

* Series--------1d array
* Data Frame----2D array (table format,row & col)

In [2]:
a=pd.Series([])
b=pd.Series([2,3123,123,124,13,431])
c=pd.Series((34,24234234234,22324,2423,324))
d=pd.Series({'a':3435,'b':4234})

C:\Users\hp\AppData\Local\Temp\ipykernel_1376\1376191169.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  a=pd.Series([])

In [3]:
print(type(a))

<class 'pandas.core.series.Series'>

In [4]:
b

0       2
1    3123
2     123
3     124
4      13
5     431
dtype: int64

In [5]:
c

0             34
1    24234234234
2          22324
3           2423
4            324
dtype: int64

In [6]:
d

a    3435
b    4234
dtype: int64

In [15]:
n=pd.array([1,2,3,4,5])

In [14]:
n

<IntegerArray>
[1, 2, 3, 4, 5]
Length: 5, dtype: Int64

In [17]:
pandas.core.series.series

NameError: name 'pandas' is not defined

In [18]:
d

a    3435
b    4234
dtype: int64

In [19]:
d[1:]

b    4234
dtype: int64

In [28]:
d['b']

4234

In [29]:
d['a':'b']

a    3435
b    4234
dtype: int64

In [30]:
d['a':'b']

a    3435
b    4234
dtype: int64

In [38]:
s=pd.Series([34,343,4,424],index=list('wwef'))

In [39]:
s

w     34
w    343
e      4
f    424
dtype: int64

In [43]:
s1=pd.Series([34,34,34,12,23,12,12])

In [45]:
s1

0    34
1    34
2    34
3    12
4    23
5    12
6    12
dtype: int64

In [46]:
s1.value_counts()  #tells about how much time a number is srepeated

34    3
12    3
23    1
dtype: int64

In [47]:
s1.argmax()

0

In [48]:
s1.argmin()

3

In [49]:
s1.idxmax()

0

In [50]:
s1.idxmin()

3

In [51]:
s.idxmin()

'e'

In [52]:
s.idxmax()

'f'

# DataFrame

In [92]:
import numpy as np

In [54]:
a= pd.DataFrame()

In [67]:
b=pd.DataFrame([32,32,23,56])

In [56]:
a

Empty DataFrame
Columns: []
Index: []

In [68]:
b

    0
0  32
1  32
2  23
3  56

In [65]:
type(b)

pandas.core.frame.DataFrame

In [69]:
b.shape

(4, 1)

In [70]:
b1=pd.DataFrame([[32,32],[23,56]])

In [71]:
b1

    0   1
0  32  32
1  23  56

In [74]:
type(b1)

pandas.core.frame.DataFrame

In [75]:
b1.shape

(2, 2)

In [76]:
b2=pd.DataFrame([[34,45,3,33,3]     ,[534,53,34,3,4]       ,[43,4,32,132,2]       ,[1,34,4,3,3]       ,[2,3,4,5,5]])

In [77]:
b2

     0   1   2    3  4
0   34  45   3   33  3
1  534  53  34    3  4
2   43   4  32  132  2
3    1  34   4    3  3
4    2   3   4    5  5

In [78]:
type(b2)

pandas.core.frame.DataFrame

In [79]:
b2.shape

(5, 5)

In [82]:
b2.head(3)

     0   1   2    3  4
0   34  45   3   33  3
1  534  53  34    3  4
2   43   4  32  132  2

In [83]:
b2.tail(3)

    0   1   2    3  4
2  43   4  32  132  2
3   1  34   4    3  3
4   2   3   4    5  5

In [85]:
b2.sample(3)

     0   1   2    3  4
1  534  53  34    3  4
4    2   3   4    5  5
2   43   4  32  132  2

In [87]:
b3=pd.DataFrame([[34,45,33,3]     ,[534,3,4]       ,[43,4,32,132,2]       ,[1,34,4,3,3]       ,[2,3,5]])

In [88]:
b3

     0   1   2      3    4
0   34  45  33    3.0  NaN
1  534   3   4    NaN  NaN
2   43   4  32  132.0  2.0
3    1  34   4    3.0  3.0
4    2   3   5    NaN  NaN

In [89]:
b3.shape

(5, 5)

In [90]:
b3=pd.DataFrame([[34,45,33,3]     ,[534,3,4]       ,[43,4, ,132,2]       ,[1,34,4,3,3]       ,[2,3,5]])

SyntaxError: invalid syntax (4246236223.py, line 1)

In [96]:
b3=pd.DataFrame([[34,45,33,3]     ,[534,3,4]       ,[43,4,np.nan,132,2]       ,[1,34,4,3,3]       ,[2,3,5]])

     0   1     2      3    4
0   34  45  33.0    3.0  NaN
1  534   3   4.0    NaN  NaN
2   43   4   NaN  132.0  2.0
3    1  34   4.0    3.0  3.0
4    2   3   5.0    NaN  NaN

In [107]:
b3=pd.DataFrame([[34,45,33,3]     ,[534,3,4]       ,[43,4,'missing',132,2]       ,[1,34,4,3,3]       ,[2,3,5]],columns=['kola','bhola','gola','chola','tola'])

In [103]:
b3

   kola  bhola     gola  chola  tola
0    34     45       33    3.0   NaN
1   534      3        4    NaN   NaN
2    43      4  missing  132.0   2.0
3     1     34        4    3.0   3.0
4     2      3        5    NaN   NaN

In [108]:
b3['tola']

0    NaN
1    NaN
2    2.0
3    3.0
4    NaN
Name: tola, dtype: float64

In [110]:
b3[['tola','gola']]

   tola     gola
0   NaN       33
1   NaN        4
2   2.0  missing
3   3.0        4
4   NaN        5

In [112]:
b3[['tola','gola']][0:3]

   tola     gola
0   NaN       33
1   NaN        4
2   2.0  missing

In [113]:
b3.shape

(5, 5)

In [114]:
b3['tola'].argmax()

3

In [115]:
b3['tola'].argmin()

2

In [130]:
b3['cola']=[34343,3,43,3,53]

In [131]:
b3

   kola  bhola     gola  chola  tola   cola
0    34     45       33    3.0   NaN  34343
1   534      3        4    NaN   NaN      3
2    43      4  missing  132.0   2.0     43
3     1     34        4    3.0   3.0      3
4     2      3        5    NaN   NaN     53

In [154]:
b3['oo']=b3['chola'] + b3['tola']

In [155]:
b3

   kola  bhola     gola  chola  tola   cola golatola     oo
0    34     45       33    3.0   NaN  34343     cola    NaN
1   534      3        4    NaN   NaN      3     cola    NaN
2    43      4  missing  132.0   2.0     43     cola  134.0
3     1     34        4    3.0   3.0      3     cola    6.0
4     2      3        5    NaN   NaN     53     cola    NaN

In [165]:
b3['bhola']>22

0     True
1    False
2    False
3     True
4    False
Name: bhola, dtype: bool

In [166]:
f=b3['bhola']>22

In [167]:
b3[f]

   kola  bhola gola  chola  tola   cola golatola   oo
0    34     45   33    3.0   NaN  34343     cola  NaN
3     1     34    4    3.0   3.0      3     cola  6.0